# default utilities
brew "curl"
brew "git"
brew "gpg"
brew "wget"

# replacements of default utilities
brew "bat" # Better cat
brew "diff-so-fancy" # Better Git diff viewer
brew "exa" # Better ls
brew "fd" # Better find
brew "htop" # Better top
brew "httpie" # Better curl
brew "ripgrep" # Better grep

# command line tools
brew "cloc" # Lines of code counter
brew "emacs"
brew "expect" # Scripting tool for interactive programs
brew "fzf" # Fuzzy finder
brew "gifsicle" # Gif tool
brew "graphviz" # Graph visualization tool
brew "hugo" # Static site builder
brew "imagemagick"
brew "jq" # JSON processor
brew "libpq" # PostgreSQL CLI
brew "magic-wormhole" # Point-to-point file sharing
brew "nnn" # Command-line file browser
brew "p7zip"
brew "pandoc"
brew "ssh-copy-id"
brew "tmux"
brew "tree"
brew "unzip"

# shell
brew "bash"
brew "z"
brew "zsh"
brew "zsh-syntax-highlighting"

# programming languages
brew "go"
brew "php"
brew "python"
brew "ruby"

# programming language tools
brew "composer" # PHP
brew "dep" # Golang
brew "nodenv" # Node environment manager
brew "nodenv/nodenv/nodenv-default-packages" # Plugin for auto-installing list of npm packages
brew "nodenv/nodenv/nodenv-package-rehash" # Plugin for auto-rehashing when a global package is installed or uninstalled
brew "shellcheck" # Shell script linter

# web service clients
brew "ddgr" # DuckDuckGo
brew "hub", args: ["HEAD"] # GitHub
brew "lastpass-cli"
tap "rockymadden/rockymadden"
brew "rockymadden/rockymadden/slack-cli"

# macOS-only  command line tools
brew "gnu-getopt" if OS.mac? # Better than BSD getopt
brew "gnu-sed" if OS.mac? # Better than BSD sed
brew "gnu-time" if OS.mac? # Better than BSD time
brew "grep" if OS.mac?
brew "mosh" if OS.mac? # Mobile shell (Brew formula does not work on Linux)

# utilities
cask "xquartz" # Needed by Inkscape

# applications
cask "docker"
cask "firefox"
cask "google-backup-and-sync"
cask "google-chrome"
cask "gpg-suite"
cask "inkscape"
cask "kap"
cask "kdiff3" # Merge tool
cask "keybase"
cask "meld" # Comparison tool for version control, files, and directories
cask "qlmarkdown"
cask "signal"
cask "sketch"
cask "spectacle"
cask "spotify"
cask "standard-notes"
cask "thunderbird"
cask "visual-studio-code"

# fonts
tap "caskroom/fonts"
cask "caskroom/fonts/font-abril-fatface"
cask "caskroom/fonts/font-arvo"
cask "caskroom/fonts/font-bitter"
cask "caskroom/fonts/font-blokk-neue"
cask "caskroom/fonts/font-fira-code"
cask "caskroom/fonts/font-hasklig"
cask "caskroom/fonts/font-lato"
cask "caskroom/fonts/font-lora"
cask "caskroom/fonts/font-noto-sans"
cask "caskroom/fonts/font-open-sans"
cask "caskroom/fonts/font-playfair-display"
cask "caskroom/fonts/font-source-code-pro"
