# command line tools
brew "gnu-getopt" # Better than BSD getopt
brew "gnu-time" # Better than BSD time
brew "grep", args: ["with-default-names"]
brew "mosh" # Mobile shell (Brew formula does not work on Linux)

# utilities
cask "xquartz" # Needed by Inkscape

# applications
cask "docker"
cask "firefox"
cask "google-backup-and-sync"
cask "google-chrome"
cask "gpg-suite"
cask "inkscape"
cask "kap"
cask "kdiff3" # Merge tool
cask "keybase"
cask "meld" # Comparison tool for version control, files, and directories
cask "qlmarkdown"
cask "signal"
cask "sketch"
cask "spectacle"
cask "spotify"
cask "standard-notes"
cask "thunderbird"
cask "visual-studio-code"

# fonts
tap "homebrew/cask-fonts"
cask "homebrew/cask-fonts/font-abril-fatface"
cask "homebrew/cask-fonts/font-arvo"
cask "homebrew/cask-fonts/font-bitter"
cask "homebrew/cask-fonts/font-blokk-neue"
cask "homebrew/cask-fonts/font-fira-code"
cask "homebrew/cask-fonts/font-hasklig"
cask "homebrew/cask-fonts/font-lato"
cask "homebrew/cask-fonts/font-lora"
cask "homebrew/cask-fonts/font-noto-sans"
cask "homebrew/cask-fonts/font-open-sans"
cask "homebrew/cask-fonts/font-playfair-display"
cask "homebrew/cask-fonts/font-source-code-pro"
cask "homebrew/cask-fonts/font-trocchi"
cask "font-yeseva-one"
